{
"author": "RenJIE",
"date": "2023.4.4 10:54:11",
"title": "我的java自学之路",
"content": "<h3>我的java自学之路</h3><p>我是半个属于计算机专业的学生，刚毕业半年，给大家讲讲我自学java的经历。这是第一篇图文，写得不好请见谅。<br>一、不是学计算机的吗？怎么要自学java？<br>大二的时候跟同学组队参加了学校的创新创业项目，我们的项目就是基于java设计一个B/S平台，所以java成了必学项目。为什么自学？因为大二还不开这个课，大二就学了c和c#，不符合我们项目的技术要求，然后就开始了掉头发的java入土之路。<br>二、具体学了什么？<br>接到这个大创项目的时候是大二第一学期，也就是2019年，放假回家之后就发生了大家都知道的事情，以致于在家上了接近大半年的网课。网课嘛，自然是不会认真听的。不听网课干啥呢？这时候我就打开了B站，找到了我的java入门导师。B站绝对是一非常好的学习网站！有人会问干嘛不看书学习，去看视频？说实话，我看书学编程我是真看不进去，不知道我这种情况是不是个例。<br>1、java篇：<br>学习编程最需要的就是动手，每个知识点我都自己敲一遍，可能看的时候不明白，自己敲一遍就能恍然大悟。然后就在这种边上学校网课，边看java的情况下，经过了三四个月终于把java基础和java进阶学习完了。刚开始学习的时候是挺痛苦的，感觉明明和老师敲的代码一模一样，自己一运行就得报错，然后检查个大半天，原来是导错包了......学到后面开始使用idea，这个东西直接称神，比那个eclipse好用一百倍。使用idea之后每天用的最多的键就是回车，还有psvm，sout，我感觉能记一辈子。建议新手不要使用idea，提示太厉害了，用这玩意学习java可能会导致最基本的东西都记不住，比如String的S到底大不大写。<br>2、sql篇：<br>学完java之后就进入了sql阶段。这个过程挺快的，因为大二第一学期在学校有这个课。但是吧，真的编程这玩意不动手就忘得快，搁置了几个月之后再来学这个的时候，感觉还是很多都很陌生。刚开始连insert语句都忘了怎么写......唯一记得最牢靠的就是select * from xxx;<br>3、jdbc篇：<br>有了java基础和sql基础，接下来就来到java与数据库连接了，刚开始能从数据中取到数据的时候别提多高兴了，到现在都深刻的记得jdbc编程六步。之后学了mybatis，果然框架才是最香的。另外记录一下连接mysql8的url得这样“jdbc:mysql://localhost:3306/test_demo?useSSL=false&serverTimezone=UTC”，driver得用这个“com.mysql.cj.jdbc.Driver”，受制于篇幅，如果想知道为什么这样配置，请百度一下。当初学的时候没跟老师使用的版本一样，自己下载了MySQL8，死活运行不起来，最后把错误信息百度了才知道mysql5和8的配置不一样......<br>4、javaweb篇：<br>在这阶段最开始学的就是html，css，js。学了才知道，原来网页就是这样做出来的啊。作为入门教程这个够了，想要让自己的网页更好看的话，B站资源很多的。了解完前端三大件之后就真正进入了javaweb，首先就是tomcat，这东西没什么好说的，没有它项目运行不起来。然后在这儿要学什么session啊，cookie啊一大堆。最重要的是会学习到servlet和jsp，现在很多人说jsp已经淘汰了，不需要学。以下纯个人观点，这个东西还是有必要学习一下，因为就算是现在出名的springmvc底层也是使用的servlet，当初的很多企业级开发都是使用的servlet和jsp，了解一下技术的过去对自己后面的学习还是会有一定帮助的。<br>5、maven篇：<br>最开始我在学完上面那些之后就准备开始进行开发我们的大创项目了，写了首页和一点点逻辑之后实在受不了spring的诱惑，然后就开始了框架学习。学习spring框架maven是逃不到的，这东西吧，刚开始学的时候会出现一些莫名奇怪的问题，经常百度一半天都找不到答案，当时我的内心是真有被整崩溃过......被pom文件中的依赖整崩溃的应该不止我一个人吧。<br>6、mybatis篇：<br>初学的想法是，这什么东西，这么复杂，还要写配置文件，我就查个用户名，又是mapper接口，又是xml文件，我用jdbc多简单啊。入门之后就知道自己的想法是多么可笑，mybatis这种方式简化了jdbc，也解除了sql语句与程序代码之间的耦合，它要是不好用怎么会火起来。<br>7、spring篇：<br>这是最劝退的东西了，说实话到现在我都还有好多不明白的地方，Ioc，aop就能花掉我好多时间去理解。各种各样的配置文件，劝退感十足，不过用起来是真香。<br>8、springMVC篇：<br>了解原理的时候就会提到servlet，所以说在之前的javaweb篇这个东西就得好好学。在这里面就会涉及到写Controller，写RequestMapping，用了之后就会发现，这玩意比servlet高级多了，又特别简单。唯一困难的就是在理解底层原理的过程。<br>9、springboot篇：<br>神器，绝对是神器，有了上面spring的基础之后，这个上手非常简单，感觉一切都变得十分美好了，少了那么多难受的配置文件，需要什么工具直接加入一个starter就行，自身集成tomcat，开箱就用，真的就是神器，所以到最后最开始提到的大创项目还是用了springboot来开发。<br>10、还有很多学到的东西，比如jQuery，vue，minio，nginx，springcloud等等，这里就不写了，主要的东西就是想聊聊基本的java学习过程。文中可能会有纰漏，还请谅解。<br>三、结语：<br>作为一个自学过来的人，我想说的是，不管学什么，如果你下定决心要学，那么就一定要坚持下去，有些知识可能学一遍不能懂，多学几遍就好了。学习过程中笔记是很重要的，有些东西可能记了并不一定会来看，但是自己记录一遍真的很有用。</p>"
}